app/controllers/foods_controller.rb

  def index

    st = SessionToken.find_by_token( session[:token] )
    @user = User.find( st.user_id )
    @food_counts = Food.new.count_foods()

        if params[:first].nil?
           @list = Food.find_all_by_user_id( st.user_id, :order => 'food_name ASC' )
        else
           @list = Food.all( :conditions => "food_name LIKE '#{params[:first]}%'", :order => 'food_name ASC' )
---
SELECT * FROM "session_tokens" WHERE ("session_tokens"."token" = 'fc2378815942dac5e7f19221062b41f75f808ddbdc6bb394bf6faa6275102710') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT count(*) AS count_all FROM "foods" WHERE (food_name LIKE 'A%')
SELECT * FROM "foods" WHERE ("foods"."user_id" = 1) ORDER BY food_name ASC
SELECT * FROM "foods" WHERE (food_name LIKE 'G%') ORDER BY food_name ASC

  def create

      st = SessionToken.find_by_token( session[:token] )
      @user = User.find( st.user_id )

      @food = Food.create(
                  :food_name => params[:food][:food_name], \
                  :serving_size => params[:food][:serving_size], \
                  :serving_in_grams => params[:food][:serving_in_grams], \
                  :unit_id => params[:food][:unit_id], \
                  :user_id => st.user_id )
---
SELECT * FROM "session_tokens" WHERE ("session_tokens"."token" = 'fc2378815942dac5e7f19221062b41f75f808ddbdc6bb394bf6faa6275102710') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "foods" ("serving_in_grams", "created_at", "serving_size", "unit_id", "food_name", "updated_at", "user_id") VALUES(38, '2010-03-16 05:35:42', 1, 12, 'Bread, Whole Wheat', '2010-03-16 05:35:42', 1)