app/controllers/login_controller.rb

  def create
    # Extract the submitted parameters
      @email = params[:user][:email].downcase
      @pw = params[:user][:pw]

      # Check the database to see if this user exists
      @user = User.find_by_email( @email )

         ###
         # User not found in the database
         if @user.nil?
              # Set the error flash
              flash[:error] = "Email account not recognized."

              # Return to the Home Controller
              redirect_to( :controller => :home, :action => :index )


         ###
         # User found, but password doesn't match
        elsif @user.pw != @pw
              # Set the error flash
              flash[:error] = "Password incorrect for this email account."
              # Update the found user with this failed login
              @user.increment( :login_failure_count )
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'clihosit@gmail.com' AND "users".id <> 1) LIMIT 1
UPDATE "users" SET "login_count" = 23, "updated_at" = '2010-03-16 18:26:52', "last_login_at" = '2010-03-16 18:26:52', "last_login_ip" = '208.54.15.106' WHERE "id" = 1

  def destroy
      # Destroy the SessionToken entry, and set the session ID to Nil
      st = SessionToken.find_by_token( session[:token] )
      session[:token] = nil
      st.delete
---
SELECT * FROM "session_tokens" WHERE ("session_tokens"."token" = '78ea8534f7ef199f029d4464c85dc2eb') LIMIT 1
DELETE FROM "session_tokens" WHERE ("id" IN (12))