app/controllers/recipes_controller.rb

    def index
        st = SessionToken.find_by_token( session[:token] )
        @user = User.find( st.user_id )
        @recipe_counts = Recipe.new.count_recipes()

        if params[:first].nil?
           @list = Recipe.find_all_by_user_id( st.user_id, :order => 'recipe_name ASC' )
        else
           @list = Recipe.all( :conditions => "recipe_name LIKE '#{params[:first]}%'", :order => 'recipe_name ASC' )
---
SELECT * FROM "session_tokens" WHERE ("session_tokens"."token" = '78ea8534f7ef199f029d4464c85dc2eb') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT count(*) AS count_all FROM "recipes" WHERE (recipe_name LIKE 'A%')
SELECT * FROM "recipes" WHERE ("recipes"."user_id" = 2) ORDER BY recipe_name ASC
SELECT * FROM "recipes" WHERE (recipe_name LIKE 'G%') ORDER BY recipe_name ASC
SELECT * FROM "users" LIMIT 1

    def create

        st = SessionToken.find_by_token( session[:token] )
        @user = User.find( st.user_id )


        @recipe = Recipe.create(
                  :recipe_name => params[:recipe][:recipe_name], \
                  :chef => params[:recipe][:chef], \
                  :source => params[:recipe][:source], \
                  :user_id => st.user_id )
---
SELECT * FROM "session_tokens" WHERE ("session_tokens"."token" = '78ea8534f7ef199f029d4464c85dc2eb') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "recipes" ("created_at", "updated_at", "recipe_name", "chef", "user_id", "source") VALUES('2010-03-15 05:48:45', '2010-03-15 05:48:45', 'PB&J', 'Mom', 1, 'Childhood')

    def edit

        st = SessionToken.find_by_token( session[:token] )
        @user = User.find( st.user_id )

        @recipe = Recipe.find( params[:id] )

        @food_counts = Food.new.count_foods()
        @list = Food.all( :conditions => "food_name LIKE 'B%'", :order => 'food_name ASC' )
---
SELECT * FROM "session_tokens" WHERE ("session_tokens"."token" = 'cd7c07d10dd5edf04e46ff749ae2fea356a277b75c7ce200caec1a57c61e6087') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "recipes" WHERE ("recipes"."id" = 7)
SELECT count(*) AS count_all FROM "foods" WHERE (food_name LIKE 'A%')
SELECT * FROM "foods" WHERE (food_name LIKE 'B%') ORDER BY food_name ASC

    def show
        st = SessionToken.find_by_token( session[:token] )
        @user = User.find( st.user_id )

        @recipe = Recipe.find( params[:id] )
---
SELECT * FROM "session_tokens" WHERE ("session_tokens"."token" = 'cd7c07d10dd5edf04e46ff749ae2fea356a277b75c7ce200caec1a57c61e6087') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)