app/controllers/users_controller.rb

  def create

          @user = User.create(
                  :screen_name => params[:user][:screen_name], \
                  :email => params[:user][:email], \
                  :pw => params[:user][:pw] )
---
INSERT INTO "users" ("created_at", "updated_at", "pw", "login_count", "last_login_ip", "last_login_at", "screen_name", "email", "login_failure_count") VALUES('2010-03-15 06:21:21', '2010-03-15 06:21:21', 'seattle', 0, '', NULL, 'Guest', 'kara@lihosit.com', 0)